load-testing/results/before-index-1000threads-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2000,
    "errorCount" : 108,
    "errorPct" : 5.4,
    "meanResTime" : 11701.395500000011,
    "medianResTime" : 9749.0,
    "minResTime" : 1194.0,
    "maxResTime" : 32802.0,
    "pct1ResTime" : 20975.8,
    "pct2ResTime" : 21967.29999999999,
    "pct3ResTime" : 23803.98,
    "throughput" : 23.155920389945702,
    "receivedKBytesPerSec" : 119.96736372017229,
    "sentKBytesPerSec" : 3.9697817952495633
  },
  "Search Users" : {
    "transaction" : "Search Users",
    "sampleCount" : 2000,
    "errorCount" : 108,
    "errorPct" : 5.4,
    "meanResTime" : 11701.395500000011,
    "medianResTime" : 9749.0,
    "minResTime" : 1194.0,
    "maxResTime" : 32802.0,
    "pct1ResTime" : 20975.8,
    "pct2ResTime" : 21967.29999999999,
    "pct3ResTime" : 23803.98,
    "throughput" : 23.155920389945702,
    "receivedKBytesPerSec" : 119.96736372017229,
    "sentKBytesPerSec" : 3.9697817952495633
  }
}